In [39]:
students_df.to_csv('students.csv', index=False)
students_df.to_excel('students.xlsx', index=False)

In [69]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 
                    'Name': ['jie', 'jing', 'leon'] })
df2 = pd.DataFrame({'ID': [1, 2, 4], 
                    'Category': ['A', 'B', 'C'],
                     'Value': [10, 20, 30]})

In [70]:
df1.set_index('ID', inplace=True)
df2.set_index('ID', inplace=True)
joined_df = df1.join(df2, how='inner')
joined_df

    Name Category  Value
ID
1    jie        A     10
2   jing        B     20

In [74]:
df = pd.DataFrame({'ID': [1, 2, 3], 
                    'Category': ['A', 'B', 'A'],
                    'Value': [10, 20, 30]})
pivot_df = df.pivot (index='ID', columns='Category', values='Value')
pivot_df

melted_df = pd.melt(df, id_vars=['ID'], value_vars=['Category', 'Value'])
melted_df

   ID  variable value
0   1  Category     A
1   2  Category     B
2   3  Category     A
3   1     Value    10
4   2     Value    20
5   3     Value    30

In [44]:
students_df

  First Name Last Name Age
0       jojo     kokoy  19
1       jeje      juan  20
2       jaja    santos  21

In [29]:
import pandas as pd

In [32]:
# datafames
data = { 'First Name': ['jojo', 'jeje', 'jaja',],
         'Last Name': [ 'kokoy', 'juan', 'santos'],
         'Age' : ['19', '20', '21']
         }

students_df = pd.DataFrame(data)